FROM python:3.6.9

# дальше идут наши переменные(к примеру: не записывать байт код и не буферить что-то)
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# создаем пустую рабочую директрию проекта в нашем докер структуре
WORKDIR /usr/src/dm_rest

# копируем файл зависимостей из хост машины в докер и запускаем их установку
COPY ./requirements.txt /usr/src/requirements.txt
RUN pip install -r /usr/src/requirements.txt

# копируем все содержимое от данного файла в только что созданную воркдир докера
COPY . /usr/src/dm_rest

# указываем по какому порту наша хост машина должна достучаться к нашему арр в докере
# EXPOSE 8000

# запускаем наш проект командами...dm_rest
# CMD ["python", "manage.py", "migrate"]
# CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]

# выше EXPOSE и CMD закоментены, потому что в докер компоуз  мы запускаем несколько программ(наш арр и постгрескл),
#  а не один сервис как(наш арр)